# Bootstraping
tap 'homebrew/cask'
tap 'homebrew/bundle'
brew 'git'
brew 'stow'

# General Applications
cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'zoomus'
cask 'clockify'
cask 'openvpn-connect'

# Developer Tools
cask 'fork'
cask 'visual-studio-code'
cask 'insomnia'
cask 'postman'
cask 'alacritty'
cask 'java'
brew 'awscli'
brew 'terraform'

# Docker Tools
cask 'docker'
brew 'dive'

# Command Line Tools
brew 'htop'
brew 'rg'
brew 'exa'
brew 'jq'

# SQL Tools
cask 'tableplus'

# JS Dev Tools
brew 'node'
brew 'yarn'
