# Bootstraping
tap 'homebrew/cask'
tap 'homebrew/bundle'
brew 'git'
brew 'stow'
brew 'mas'
brew 'reattach-to-user-namespace'

# General Applications
cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'zoomus'
cask 'clockify'
cask 'openvpn-connect'
cask 'alfred'
cask 'discord'
cask 'microsoft-teams'

# Mac App Store Applications
mas 'Todoist', id: 585829637
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Powerpoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
mas 'OneDrive', id:823766827
mas 'Texpad', id: 458866234

# Developer Tools
cask 'fork'
cask 'visual-studio-code'
cask 'insomnia'
cask 'postman'
cask 'alacritty'
brew 'openjdk'
cask 'dash'
brew 'awscli'
brew 'awsebcli'
brew 'terraform'
brew 'neovim'
brew 'tmux'

# Docker Tools
cask 'docker'
brew 'dive'

# Command Line Tools
brew 'htop'
brew 'rg'
brew 'exa'
brew 'jq'
brew 'antibody'

# SQL Tools
cask 'tableplus'

# JS Dev Tools
brew 'node'
brew 'yarn'

# Java Dev Tools
brew 'jhipster'
brew 'kotlin'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-saucecodepro-nerd-font'
cask 'font-fira-code-nerd-font'
